<img src="../../img/python-logo-no-text.svg"
     style="display:block;margin:auto;width:10%"/>
<br>
<div style="text-align:center; font-size:200%;">
  <b>Pandas Data Frames 2</b>
</div>
<br/>
<div style="text-align:center;">Dr. Matthias HÃ¶lzl</div>
<br/>
<div style="text-align:center;">module_610_pandas/topic_130_pandas_data_frames_2</div>

In [2]:
import numpy as np
import pandas as pd

## Fehlende Werte

In [3]:
def create_data_frame_with_nans():
    return pd.DataFrame(
        {
            "A": [1, 2, np.nan, np.nan, 0],
            "B": [5, 6, 7, np.nan, 0],
            "C": [9, 10, 11, 12, 0],
            "D": [13, 14, 15, 16, 0],
            "E": [np.nan, 18, 19, 20, 0],
        }
    )

In [4]:
df = create_data_frame_with_nans()
df

     A    B   C   D     E
0  1.0  5.0   9  13   NaN
1  2.0  6.0  10  14  18.0
2  NaN  7.0  11  15  19.0
3  NaN  NaN  12  16  20.0
4  0.0  0.0   0   0   0.0

In [5]:
df.isna()

       A      B      C      D      E
0  False  False  False  False   True
1  False  False  False  False  False
2   True  False  False  False  False
3   True   True  False  False  False
4  False  False  False  False  False

In [6]:
df.count()

A    3
B    4
C    5
D    5
E    4
dtype: int64

In [7]:
df.count(axis=1)

0    4
1    5
2    4
3    3
4    5
dtype: int64

In [9]:
df.isna().sum()

A    2
B    1
C    0
D    0
E    1
dtype: int64

In [10]:
df.dropna()

     A    B   C   D     E
1  2.0  6.0  10  14  18.0
4  0.0  0.0   0   0   0.0

In [11]:
df

     A    B   C   D     E
0  1.0  5.0   9  13   NaN
1  2.0  6.0  10  14  18.0
2  NaN  7.0  11  15  19.0
3  NaN  NaN  12  16  20.0
4  0.0  0.0   0   0   0.0

In [13]:
df.dropna(inplace=True)

In [14]:
df

     A    B   C   D     E
1  2.0  6.0  10  14  18.0
4  0.0  0.0   0   0   0.0

In [15]:
df = create_data_frame_with_nans()
df

     A    B   C   D     E
0  1.0  5.0   9  13   NaN
1  2.0  6.0  10  14  18.0
2  NaN  7.0  11  15  19.0
3  NaN  NaN  12  16  20.0
4  0.0  0.0   0   0   0.0

In [16]:
df.fillna(value=1000)

        A       B   C   D       E
0     1.0     5.0   9  13  1000.0
1     2.0     6.0  10  14    18.0
2  1000.0     7.0  11  15    19.0
3  1000.0  1000.0  12  16    20.0
4     0.0     0.0   0   0     0.0

In [18]:
df.mean()

A     1.00
B     4.50
C     8.40
D    11.60
E    14.25
dtype: float64

In [17]:
df.fillna(value=df.mean())

     A    B   C   D      E
0  1.0  5.0   9  13  14.25
1  2.0  6.0  10  14  18.00
2  1.0  7.0  11  15  19.00
3  1.0  4.5  12  16  20.00
4  0.0  0.0   0   0   0.00

## Gruppieren

In [19]:
def create_course_df():
    data = {
        "Course": [
            "Python",
            "Python",
            "Python",
            "Python",
            "Java",
            "Java",
            "Java",
            "C++",
            "C++",
        ],
        "Person": [
            "Jack",
            "Jill",
            "John",
            "Bill",
            "Jack",
            "Bill",
            "Davy",
            "Jack",
            "Diane",
        ],
        "Score": [97, 92, 38, 73, 81, 52, 62, 86, 98],
    }
    return pd.DataFrame(data)

## Operationen (Fortsetzung)

## Auswahl


## Transformation von Daten

## Elementweise Anwendung von Funktionen: